#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```


Warning: Argument is deprecated

  with aws_api_gateway_deployment.deployment,
  on apigateway.tf line 193, in resource "aws_api_gateway_deployment" "deployment":
 193:   stage_name  = "dev"

The attribute "stage_name" will be removed in a future major version. Use an
explicit "aws_api_gateway_stage" instead.
Success! The configuration is valid, but there were some validation warnings
as shown above.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.archive_file.lambda_stop_package: Reading...
data.archive_file.lambda_package: Reading...
data.archive_file.lambda_stop_package: Read complete after 0s [id=7e10e15c20bde92cb0950226c51efcdc7865c8e5]
data.archive_file.lambda_package: Read complete after 0s [id=add2660100fde94410d1c552100036a8eae36446]
aws_iam_user_group_membership.s3_user_membership: Refreshing state... [id=terraform-20240104131439668600000002]
aws_iam_user.s3_user: Refreshing state... [id=s3-access-user]
aws_api_gateway_rest_api.stop_ec2_gateway: Refreshing state... [id=1k9ub8vhk6]
aws_iam_group.s3_access_group: Refreshing state... [id=s3-access-group]
aws_iam_role.lambda_role: Refreshing state... [id=lambda-role]
aws_iam_policy.cloudwatch_logs_policy: Refreshing state... [id=arn:aws:iam::117572128031:policy/cloudwatch_logs_policy]
aws_secretsmanager_secret.api_key: Refreshing state... [id=arn:aws:secretsmanager:eu-central-1:117572128031:secret:transcription_service_api_key-lOlyvY]
aws_iam_role.access_s3_and_logs: Refreshing state... [id=access_s3_and_logs_role]
aws_security_group.allow_all: Refreshing state... [id=sg-066a59bd2a442570c]
aws_iam_policy.stop_lambda_policy: Refreshing state... [id=arn:aws:iam::117572128031:policy/stop_lambda_policy]
aws_iam_policy.lambda_policy: Refreshing state... [id=arn:aws:iam::117572128031:policy/lambda_policy]
aws_s3_bucket.transcript-bucket: Refreshing state... [id=transcript-bucket20231207181110470300000001]
aws_api_gateway_rest_api.transcription_gateway: Refreshing state... [id=hzjgd3yz9g]
aws_iam_policy.secrets_manager_policy: Refreshing state... [id=arn:aws:iam::117572128031:policy/secrets_manager_policy]
aws_iam_group_policy_attachment.s3_access_attachment: Refreshing state... [id=s3-access-group-20240104131439668300000001]
aws_iam_role_policy_attachment.lambda_basic["arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"]: Refreshing state... [id=lambda-role-20231209192723097600000002]
aws_lambda_function.stop_lambda: Refreshing state... [id=stopEC2Function]
aws_iam_role_policy_attachment.lambda_basic["arn:aws:iam::aws:policy/AmazonEC2FullAccess"]: Refreshing state... [id=lambda-role-20231209192723088800000001]
aws_iam_role_policy_attachment.cloudwatch_logs_access: Refreshing state... [id=access_s3_and_logs_role-20250106171900274000000002]
aws_iam_instance_profile.ec2_profile: Refreshing state... [id=ec2_s3_and_logs_profile]
aws_iam_role_policy_attachment.s3_access: Refreshing state... [id=access_s3_and_logs_role-20250106171900258100000001]
aws_iam_role_policy_attachment.secrets_manager_access: Refreshing state... [id=access_s3_and_logs_role-20250106171900302500000003]
aws_secretsmanager_secret_version.api_key_version: Refreshing state... [id=arn:aws:secretsmanager:eu-central-1:117572128031:secret:transcription_service_api_key-lOlyvY|terraform-20250105180424256100000001]
aws_api_gateway_resource.stop_root: Refreshing state... [id=x1c8e2]
aws_api_gateway_resource.root: Refreshing state... [id=w3noxm]
aws_instance.transcription_server: Refreshing state... [id=i-03b86fbdd7b724624]
aws_api_gateway_method.stop_proxy: Refreshing state... [id=agm-1k9ub8vhk6-x1c8e2-GET]
aws_api_gateway_method.proxy: Refreshing state... [id=agm-hzjgd3yz9g-w3noxm-GET]
aws_api_gateway_method.options: Refreshing state... [id=agm-hzjgd3yz9g-w3noxm-OPTIONS]
aws_api_gateway_method_response.proxy: Refreshing state... [id=agmr-hzjgd3yz9g-w3noxm-GET-200]
aws_api_gateway_method_response.stop_proxy: Refreshing state... [id=agmr-1k9ub8vhk6-x1c8e2-GET-200]
aws_api_gateway_method_response.options_response: Refreshing state... [id=agmr-hzjgd3yz9g-w3noxm-OPTIONS-200]
aws_api_gateway_integration.options_integration: Refreshing state... [id=agi-hzjgd3yz9g-w3noxm-OPTIONS]
aws_api_gateway_integration_response.options_integration_response: Refreshing state... [id=agir-hzjgd3yz9g-w3noxm-OPTIONS-200]
aws_lambda_permission.stop_apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
aws_api_gateway_integration.stop_lambda_integration: Refreshing state... [id=agi-1k9ub8vhk6-x1c8e2-GET]
aws_api_gateway_deployment.stop_deployment: Refreshing state... [id=f3wqgu]
aws_api_gateway_integration_response.stop_proxy: Refreshing state... [id=agir-1k9ub8vhk6-x1c8e2-GET-200]
aws_api_gateway_stage.stop_dev: Refreshing state... [id=ags-1k9ub8vhk6-dev]
aws_lambda_function.start_lambda: Refreshing state... [id=startTranscriptionFunction]
aws_s3_bucket_policy.transcript-bucket-policy: Refreshing state... [id=transcript-bucket20231207181110470300000001]
aws_s3_bucket_cors_configuration.transcript-bucket-cors: Refreshing state... [id=transcript-bucket20231207181110470300000001]
aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
aws_api_gateway_integration.lambda_integration: Refreshing state... [id=agi-hzjgd3yz9g-w3noxm-GET]
aws_api_gateway_integration_response.proxy: Refreshing state... [id=agir-hzjgd3yz9g-w3noxm-GET-200]
aws_api_gateway_deployment.deployment: Refreshing state... [id=ey4o6i]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_api_gateway_integration.options_integration must be replaced
-/+ resource "aws_api_gateway_integration" "options_integration" {
      - cache_key_parameters    = [] -> null
      ~ cache_namespace         = "w3noxm" -> (known after apply)
      ~ id                      = "agi-hzjgd3yz9g-w3noxm-OPTIONS" -> (known after apply)
      + integration_http_method = "OPTIONS" # forces replacement
      ~ passthrough_behavior    = "WHEN_NO_MATCH" -> (known after apply)
      - request_parameters      = {} -> null
        # (7 unchanged attributes hidden)
    }

  # aws_api_gateway_integration_response.options_integration_response will be created
  + resource "aws_api_gateway_integration_response" "options_integration_response" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + resource_id         = "w3noxm"
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,X-Amz-Date,Authorization,X-Api-Key,X-Amz-Security-Token'"
          + "method.response.header.Access-Control-Allow-Methods" = "'GET,OPTIONS,POST,PUT'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        }
      + rest_api_id         = "hzjgd3yz9g"
      + status_code         = "200"
    }

  # aws_iam_group.nextjs_access_group will be created
  + resource "aws_iam_group" "nextjs_access_group" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "nextjs-access-group"
      + path      = "/"
      + unique_id = (known after apply)
    }

  # aws_iam_group.s3_access_group will be destroyed
  # (because aws_iam_group.s3_access_group is not in configuration)
  - resource "aws_iam_group" "s3_access_group" {
      - arn       = "arn:aws:iam::117572128031:group/s3-access-group" -> null
      - id        = "s3-access-group" -> null
      - name      = "s3-access-group" -> null
      - path      = "/" -> null
      - unique_id = "AGPARWX6YJUP3EBP6P7DQ" -> null
    }

  # aws_iam_group_policy_attachment.cloudwatch_access_attachment will be created
  + resource "aws_iam_group_policy_attachment" "cloudwatch_access_attachment" {
      + group      = "nextjs-access-group"
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/CloudWatchFullAccess"
    }

  # aws_iam_group_policy_attachment.s3_access_attachment must be replaced
-/+ resource "aws_iam_group_policy_attachment" "s3_access_attachment" {
      ~ group      = "s3-access-group" -> "nextjs-access-group" # forces replacement
      ~ id         = "s3-access-group-20240104131439668300000001" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_iam_user.nextjs_user will be created
  + resource "aws_iam_user" "nextjs_user" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "nextjs-access-user"
      + path          = "/"
      + tags_all      = (known after apply)
      + unique_id     = (known after apply)
    }

  # aws_iam_user.s3_user will be destroyed
  # (because aws_iam_user.s3_user is not in configuration)
  - resource "aws_iam_user" "s3_user" {
      - arn           = "arn:aws:iam::117572128031:user/s3-access-user" -> null
      - force_destroy = false -> null
      - id            = "s3-access-user" -> null
      - name          = "s3-access-user" -> null
      - path          = "/" -> null
      - tags          = {} -> null
      - tags_all      = {} -> null
      - unique_id     = "AIDARWX6YJUPXEPLKFKAH" -> null
    }

  # aws_iam_user_group_membership.nextjs_user_membership will be created
  + resource "aws_iam_user_group_membership" "nextjs_user_membership" {
      + groups = [
          + "nextjs-access-group",
        ]
      + id     = (known after apply)
      + user   = "nextjs-access-user"
    }

  # aws_iam_user_group_membership.s3_user_membership will be destroyed
  # (because aws_iam_user_group_membership.s3_user_membership is not in configuration)
  - resource "aws_iam_user_group_membership" "s3_user_membership" {
      - groups = [
          - "s3-access-group",
        ] -> null
      - id     = "terraform-20240104131439668600000002" -> null
      - user   = "s3-access-user" -> null
    }

  # aws_s3_bucket_policy.transcript-bucket-policy will be updated in-place
  ~ resource "aws_s3_bucket_policy" "transcript-bucket-policy" {
        id     = "transcript-bucket20231207181110470300000001"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:*"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::117572128031:user/s3-access-user"
                        }
                      - Resource  = [
                          - "arn:aws:s3:::transcript-bucket20231207181110470300000001",
                          - "arn:aws:s3:::transcript-bucket20231207181110470300000001/*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 7 to add, 1 to change, 5 to destroy.

Warning: Argument is deprecated

  with aws_api_gateway_deployment.deployment,
  on apigateway.tf line 193, in resource "aws_api_gateway_deployment" "deployment":
 193:   stage_name  = "dev"

The attribute "stage_name" will be removed in a future major version. Use an
explicit "aws_api_gateway_stage" instead.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @hanneskoksch, Action: `pull_request`*